[
  {
    "id": "whoami",
    "title": "WHOAMI",
    "image": {
      "img": "https://miro.medium.com/v2/resize:fit:800/1*zBt7jTqboGAM0BC0m12oHQ.png",
      "imgTitle": "Linux Terminal command: whoami",
      "imgAuthor": "",
      "imgAuthorLink": "",
      "imgLink": "https://miro.medium.com/v2/resize:fit:800/1*zBt7jTqboGAM0BC0m12oHQ.png"
    },
    "content": "Hello, my name is Ghali (aka ggg or triple g), and welcome to my site. This site is more of a personal site, where I share projects that I made and also for my blogs.\r\n## **So whoami**\r\nBy the time I'm writing this, I'm 18 years old. I love coding and IT (Information technology), but I generally love learning. I have found knowledge interesting since I was a kid, and my passion for technology has only grown stronger over the years, too.\r\n\r\nAs a child, I used to find the world fascinating, and I still do. I developed a passion for science, and I found it puzzling. The feeling when you understood something was amazing. Technology only rewarded that puzzle.\r\n\r\nBy the age of 13 - back in the summer of 2018, I discovered coding. And I started coding Discord bots using [discord.js](https://discord.js.org/), a [node.js](https://nodejs.org/en) library. So, my first programming language was [Javascript](https://en.m.wikipedia.org/wiki/JavaScript). In 2020, I made my first serious project with two friends, Y0ung and Smart. [Hit Radio discord bot](https://discord.gg/8RfM6W2E), a bot that plays a Moroccan Radio station, ultimately, throughout the years and even with less consistent work on the bot tho, the bot gained a small popularity, reaching close to 500 servers and 85k users, which really is one of my favorite achievements, I got into hacking later that year and started playing [CTFs (capture the flag)](https://en.m.wikipedia.org/wiki/Capture_the_flag_(cybersecurity)), which they are these hacking games, where u try to break a challenge and getting code which called the flag. After two years I got into drugs and - let's just say I experimented with some - so and I know this is a dumb thing to say but I'll say it anyway. I love drugs, I think if used moderately, they can be beneficial to people. So yeah, I smoke weed, love that drug tried LSD once and I loved it too - I will talk about them both later on another blog, as I think they are both beneficial too -\r\n\r\nSo this will be a short autobiography about me - I'm not a writer by the way -\r\n\r\nI love music too, to be honest, I listen to everything but my favorite genres are EDM, techno and house, I'm really a fan of Ye and I found his music amazing, love Fred again too and many artists too, this is my [Spotify](https://open.spotify.com/user/31z5m5mz557r5mpipqsohrwyjkmq?si=nKbaWKsBTfy4qD3jOVNP3g) if you wanna listen to my playlists, I also love movies, I'm talking good movies, I love a lot and if I have to choose my top 10, it would be :\r\n\r\n• Everything everywhere all at once\r\n• Interstellar\r\n• Inception \r\n• Paprika \r\n• Project X\r\n• Enter the void \r\n• Daisies\r\n• The hangover\r\n• The pursuit of happyness\r\n• Midsommar \r\n\r\nI watched a lot but those what I can remember, this is [my letterboxd](https://boxd.it/6GdbF) and this is [the list of movies I watched](https://boxd.it/npgXc). I love shows too my favorites are:\r\n\r\n• Mr Robot\r\n• Breaking Bad\r\n• How to sell drugs online(fast)\r\n• Neon Genesis Evangelion\r\n• Black Mirror\r\n\r\nI watched a lot too, and I can't mention them all.\r\n\r\nI think I mentioned everything about me, I might do other blogs on other topics later. I hope you enjoyed the read and I hope you have a good day or night, love you all xoxo!",
    "description": "A very short autobiography about me",
    "view": "public",
    "date": "January 13, 2025"
  }
]